app/controllers/books_controller.rb

  def index
      @books = Book.all
    if params[:pricesortasc]
      @books = @books.order(:price)          # sort by price ascending
    end
    if params[:pricesortdesc]
      @books = @books.order(price: :desc)    # sort by price descending
    end
    if params[:freebooks]
      @books = @books.where("price = 0")     # select free books
    end
    if params[:tag2]
      @books = Book.joins(:tag).where(:tags => {:tag2 => 'true'})   # list books with tag2 checked
    end
    if params[:tag1]
      @books = Book.joins(:tag).where(:tags => {:tag1 => 'true'})   # list books with tag1 checked
    end
    if params[:tag3]
        @books = Book.joins(:tag).where(:tags => {:tag3 => 'true'})  # list books with tag3 checked
---
SELECT `books`.* FROM `books` ORDER BY `books`.`id` DESC LIMIT 1
SELECT `books`.* FROM `books` ORDER BY `books`.`price` DESC
SELECT `books`.* FROM `books` INNER JOIN `tags` ON `tags`.`book_id` = `books`.`id` WHERE (tags.tag2 = true AND  tags.tag3 = true AND books.price >=  0)
SELECT `books`.* FROM `books` INNER JOIN `tags` ON `tags`.`book_id` = `books`.`id` WHERE `tags`.`tag1` = TRUE AND `tags`.`tag2` = TRUE
SELECT `books`.* FROM `books` INNER JOIN `tags` ON `tags`.`book_id` = `books`.`id` WHERE `tags`.`tag2` = TRUE AND `tags`.`tag3` = TRUE AND `books`.`price` = 56

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`title`, `description`, `price`, `created_at`, `updated_at`) VALUES ('Subgroup Growth', 'In the last two decades this topic has developed into one of the most active areas of research in infinite group theory; this book is a systematic and comprehensive account of the substantial theory which has emerged.', 5, '2021-12-19 09:47:31.661019', '2021-12-19 09:47:31.661019')

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE `books` SET `books`.`description` = 'This story in The Bane Chronicles, the Course of True Love (and First Dates), is written by Cassandra Clare.', `books`.`updated_at` = '2021-12-20 17:38:34.346726' WHERE `books`.`id` = 2

  def destroy
    @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 1

    def set_book
      @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1