app/controllers/tags_controller.rb

SELECT `tags`.* FROM `tags`
---
  def index
    @tags = Tag.all

INSERT INTO `tags` (`book_id`, `tag1`, `tag2`, `tag3`, `created_at`, `updated_at`) VALUES (3, TRUE, TRUE, FALSE, '2021-12-20 17:41:31.561780', '2021-12-20 17:41:31.561780')
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save

SELECT `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
---
    def set_tag
      @tag = Tag.find(params[:id])